Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet
A set that contains MEPBuildingConstructions.

Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet.Insert(Autodesk.Revit.DB.Mechanical.MEPBuildingConstruction)
System.Int32
Insert the specified MEPBuildingConstruction into the set.
item: The MEPBuildingConstruction to be inserted into the set.
Returns: Returns whether the MEPBuildingConstruction was inserted into the set.

Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet.GetEnumerator
System.Collections.IEnumerator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet.ReverseIterator
Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSetIterator
Retrieve a backward moving iterator to the set.
Returns: Returns a backward moving iterator to the set.

Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet.ForwardIterator
Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSetIterator
Retrieve a forward moving iterator to the set.
Returns: Returns a forward moving iterator to the set.

Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet.Erase(Autodesk.Revit.DB.Mechanical.MEPBuildingConstruction)
System.Int32
Removes a specified MEPBuildingConstruction from the set.
item: The MEPBuildingConstruction to be erased.
Returns: The number of MEPBuildingConstructions that were erased from the set.

Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet.Contains(Autodesk.Revit.DB.Mechanical.MEPBuildingConstruction)
System.Boolean
Tests for the existence of a MEPBuildingConstruction within the set.
item: The MEPBuildingConstruction to be searched for.
Returns: The Contains method returns True if the MEPBuildingConstruction is within the set, otherwise False.

Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet.Clear
void
Removes every MEPBuildingConstruction from the set, rendering it empty.

Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet.Size
System.Int32
get
Returns the number of MEPBuildingConstructions that are in the set.

Autodesk.Revit.DB.Mechanical.MEPBuildingConstructionSet.IsEmpty
System.Boolean
get
Test to see if the set is empty.
Remarks: If the set is empty then True will be returned, otherwise False.